#include <iostream>
using namespace std;

int main() {

	setlocale(LC_ALL, "Rus");

	//int n , m;
	//int counter = 0;
	// Задача Длинна числа
	/*cout << "Задача 1.\nВведите число->";
	cin >> n;
	counter = 0;
	m = 1;
	do {
		m *= 10;
		counter++;
	} while (n % m != n);
	cout << "Длинна числа   " << n << "  " << counter << " \n\n";*/


	// Задача 2 Безконечный ввод чисел . Введите числа до тех пор пока не введете 0
	//1) Найти максимальное число
	//2) Найти его порядковый номер
	
	//cout << "Задача 2.\nВведите 1 число ->";
	//cin >> n;
	//m = n;

	//counter = 1;
	//int max_c = 1; // Это позиция максимум
	//while (n) {counter++;                       // Пока n не равно нулю  (n != 0) можно не писать в цикле while Оно само собой разумеет по этому пишем  n

	//cout << "Введите число " << counter << " -е число - > ";
	//cin >> n;
	//if (n > m){

	//	m = n;
	//	max_c = counter; //  в  записываем максимум новый 
	//}
	//}
	//int k = 0;  // Вооди переменную для расчета количества делений Счетчик сифр
	//int copy = m; // Копия максимум
	//do {
	//	copy /= 10;
	//	k++;
	//} while (copy);


	//cout << " Максимум равен " << m << " \n";
	//cout << " Его порядковый номер  " << max_c << " \n";
	//cout<< " Его длинна: " << k << " \n\n";


	// Задача 3 FizzBuzz
	/*cout << "Задача 3.\nВведите число->";
	cin >> n;
	for (int i = 1; i <= n; i++)
		if (i % 3 == 0 && i % 5 == 0)
			cout << " FizzBuzz \n";
		else
			if(i%3 == 0)
				cout << " Fizz \n";
			else
				if(i%5 ==0)
					cout << " Buzz \n";
				else
					cout << i<< " \n";*/


	// Задача 4 Факториал
	//cout << "Задача 4.\nВведите не отрицательное число->";
	//cin >> n;
	//unsigned long long fact = 1; // Тут пишем 1 т.к мф сможем осуществить проверку если введут 0, а если написать 0 то цикл не разу не запустится
	//// Пишем unsigned long long используем с работой	 ФАКТОРИАЛ 8 бит. До 60 факториала.
	//for (int i = 2; i <= n; i++)
	//	fact *= i;
	//cout << n << "! = " << fact << " \n";


	// Задача 5 Совершенное число Часть1
	/*cout << "Задача 5.\nВведите не отрицательное число->";
	cin >> n;
	int sum1 = 0;
	for (int i = 1; i <= n / 2; i++)
		if(n%i == 0)
		sum1 += i;
	if (sum1 == n)
		cout << "Число " << n << " совершенное.\n";
	else
		cout << "Число " << n << " не совершенное.\n";*/

		// Задача 5 Совершенное число Часть2
		/*cout << "Задача 5.\n:Все совершенные числа в диапазоне от 1 - 10000: ";
		int sum2 = 0;
		for (int j = 1; j <= 10000; j++) {
			sum2 = 0;
			for (int i = 1; i <= j / 2; i++)
				if (j % i == 0)
					sum2 += i;
			if (sum2 == j)
				cout << j << " совершенное.\n";
		}*/

		// Задача 6 Самостоятельная работа Угадай число от 1 до 500
		
	//Напишите игру «Угадай число».Программа загадывает число в диапазоне от 1 до 500. Пользователь пытается его угадать.
	// После каждой попытки программа выдает подсказки, больше или меньше его число, чем загаданное.
	// В конце программа выдает статистику - за сколько попыток угадано число.
	//Дополнительно: необходимо предусмотреть выход при введении 0, в случае, если пользователю надоело угадывать число.



int const p = 3;
int  number;
int counter = 0;
 
do
{
	cout << "Введите число -> ";
	cin >> number;
	counter++;
	if (number == 0)
	{
		cout << "Конец игры!!\n";
		break;
	}
	else
	{
		if (number == p)
		{
			cout << "Вы угадали число - " << p << " всего c " << counter << " -ой попытки. Поздравляю!!!\n";
			break;
		}
		else
		{
			cout << "Ввели число " << (number > p ? " больше " : " меньше ") << " загаданного\n";
		}
	}

} while (true);



	return 0;
}